; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	thermograph3 - mode
	infrared0 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 172)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 107)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 180)
	(= (data Planet5 infrared1) 281)
	(= (data Star6 infrared1) 171)
	(= (data Planet7 infrared1) 211)
	(= (data Phenomenon8 infrared1) 263)
	(= (data Planet9 infrared1) 7)
	(= (data Planet10 infrared1) 15)
	(= (data Phenomenon11 infrared1) 45)
	(= (data Planet12 infrared1) 295)
	(= (data Planet13 infrared1) 126)
	(= (data Star14 infrared1) 14)
	(= (data Planet5 thermograph3) 97)
	(= (data Star6 thermograph3) 64)
	(= (data Planet7 thermograph3) 84)
	(= (data Phenomenon8 thermograph3) 8)
	(= (data Planet9 thermograph3) 127)
	(= (data Planet10 thermograph3) 21)
	(= (data Phenomenon11 thermograph3) 234)
	(= (data Planet12 thermograph3) 215)
	(= (data Planet13 thermograph3) 128)
	(= (data Star14 thermograph3) 25)
	(= (data Planet5 infrared0) 248)
	(= (data Star6 infrared0) 197)
	(= (data Planet7 infrared0) 91)
	(= (data Phenomenon8 infrared0) 31)
	(= (data Planet9 infrared0) 90)
	(= (data Planet10 infrared0) 231)
	(= (data Phenomenon11 infrared0) 281)
	(= (data Planet12 infrared0) 149)
	(= (data Planet13 infrared0) 300)
	(= (data Star14 infrared0) 246)
	(= (data Planet5 spectrograph2) 106)
	(= (data Star6 spectrograph2) 159)
	(= (data Planet7 spectrograph2) 156)
	(= (data Phenomenon8 spectrograph2) 215)
	(= (data Planet9 spectrograph2) 287)
	(= (data Planet10 spectrograph2) 253)
	(= (data Phenomenon11 spectrograph2) 292)
	(= (data Planet12 spectrograph2) 115)
	(= (data Planet13 spectrograph2) 45)
	(= (data Star14 spectrograph2) 169)
	(= (slew_time GroundStation2 Star0) 12)
	(= (slew_time Star0 GroundStation2) 12)
	(= (slew_time GroundStation2 GroundStation1) 37.76)
	(= (slew_time GroundStation1 GroundStation2) 37.76)
	(= (slew_time Star4 Star0) 7.058)
	(= (slew_time Star0 Star4) 7.058)
	(= (slew_time Star4 GroundStation1) 77.32)
	(= (slew_time GroundStation1 Star4) 77.32)
	(= (slew_time Star4 GroundStation2) 27.68)
	(= (slew_time GroundStation2 Star4) 27.68)
	(= (slew_time Star4 GroundStation3) 3.676)
	(= (slew_time GroundStation3 Star4) 3.676)
	(= (slew_time GroundStation3 Star0) 10.16)
	(= (slew_time Star0 GroundStation3) 10.16)
	(= (slew_time GroundStation3 GroundStation1) 20.23)
	(= (slew_time GroundStation1 GroundStation3) 20.23)
	(= (slew_time GroundStation3 GroundStation2) 18.53)
	(= (slew_time GroundStation2 GroundStation3) 18.53)
	(= (slew_time GroundStation1 Star0) 23.45)
	(= (slew_time Star0 GroundStation1) 23.45)
	(= (slew_time Planet5 Star0) 6.348)
	(= (slew_time Star0 Planet5) 6.348)
	(= (slew_time Planet5 GroundStation1) 12.66)
	(= (slew_time GroundStation1 Planet5) 12.66)
	(= (slew_time Planet5 GroundStation2) 78.65)
	(= (slew_time GroundStation2 Planet5) 78.65)
	(= (slew_time Planet5 GroundStation3) 43.16)
	(= (slew_time GroundStation3 Planet5) 43.16)
	(= (slew_time Planet5 Star4) 37.93)
	(= (slew_time Star4 Planet5) 37.93)
	(= (slew_time Star6 Star0) 55.81)
	(= (slew_time Star0 Star6) 55.81)
	(= (slew_time Star6 GroundStation1) 48.15)
	(= (slew_time GroundStation1 Star6) 48.15)
	(= (slew_time Star6 GroundStation2) 28.63)
	(= (slew_time GroundStation2 Star6) 28.63)
	(= (slew_time Star6 GroundStation3) 17.29)
	(= (slew_time GroundStation3 Star6) 17.29)
	(= (slew_time Star6 Star4) 83.35)
	(= (slew_time Star4 Star6) 83.35)
	(= (slew_time Star6 Planet5) 65.01)
	(= (slew_time Planet5 Star6) 65.01)
	(= (slew_time Planet7 Star0) 41.04)
	(= (slew_time Star0 Planet7) 41.04)
	(= (slew_time Planet7 GroundStation1) 3.565)
	(= (slew_time GroundStation1 Planet7) 3.565)
	(= (slew_time Planet7 GroundStation2) 93.23)
	(= (slew_time GroundStation2 Planet7) 93.23)
	(= (slew_time Planet7 GroundStation3) 54.29)
	(= (slew_time GroundStation3 Planet7) 54.29)
	(= (slew_time Planet7 Star4) 23.51)
	(= (slew_time Star4 Planet7) 23.51)
	(= (slew_time Planet7 Planet5) 35.53)
	(= (slew_time Planet5 Planet7) 35.53)
	(= (slew_time Planet7 Star6) 70.32)
	(= (slew_time Star6 Planet7) 70.32)
	(= (slew_time Phenomenon8 Star0) 62.78)
	(= (slew_time Star0 Phenomenon8) 62.78)
	(= (slew_time Phenomenon8 GroundStation1) 16.04)
	(= (slew_time GroundStation1 Phenomenon8) 16.04)
	(= (slew_time Phenomenon8 GroundStation2) 11.76)
	(= (slew_time GroundStation2 Phenomenon8) 11.76)
	(= (slew_time Phenomenon8 GroundStation3) 33.91)
	(= (slew_time GroundStation3 Phenomenon8) 33.91)
	(= (slew_time Phenomenon8 Star4) 41.72)
	(= (slew_time Star4 Phenomenon8) 41.72)
	(= (slew_time Phenomenon8 Planet5) 10.44)
	(= (slew_time Planet5 Phenomenon8) 10.44)
	(= (slew_time Phenomenon8 Star6) 48.79)
	(= (slew_time Star6 Phenomenon8) 48.79)
	(= (slew_time Phenomenon8 Planet7) 19.76)
	(= (slew_time Planet7 Phenomenon8) 19.76)
	(= (slew_time Planet9 Star0) 14.94)
	(= (slew_time Star0 Planet9) 14.94)
	(= (slew_time Planet9 GroundStation1) 16.01)
	(= (slew_time GroundStation1 Planet9) 16.01)
	(= (slew_time Planet9 GroundStation2) 89)
	(= (slew_time GroundStation2 Planet9) 89)
	(= (slew_time Planet9 GroundStation3) 0.5189)
	(= (slew_time GroundStation3 Planet9) 0.5189)
	(= (slew_time Planet9 Star4) 20.53)
	(= (slew_time Star4 Planet9) 20.53)
	(= (slew_time Planet9 Planet5) 11.45)
	(= (slew_time Planet5 Planet9) 11.45)
	(= (slew_time Planet9 Star6) 22.82)
	(= (slew_time Star6 Planet9) 22.82)
	(= (slew_time Planet9 Planet7) 28.7)
	(= (slew_time Planet7 Planet9) 28.7)
	(= (slew_time Planet9 Phenomenon8) 20.3)
	(= (slew_time Phenomenon8 Planet9) 20.3)
	(= (slew_time Planet10 Star0) 63.18)
	(= (slew_time Star0 Planet10) 63.18)
	(= (slew_time Planet10 GroundStation1) 10.5)
	(= (slew_time GroundStation1 Planet10) 10.5)
	(= (slew_time Planet10 GroundStation2) 62.27)
	(= (slew_time GroundStation2 Planet10) 62.27)
	(= (slew_time Planet10 GroundStation3) 3.085)
	(= (slew_time GroundStation3 Planet10) 3.085)
	(= (slew_time Planet10 Star4) 20.35)
	(= (slew_time Star4 Planet10) 20.35)
	(= (slew_time Planet10 Planet5) 29.78)
	(= (slew_time Planet5 Planet10) 29.78)
	(= (slew_time Planet10 Star6) 18.3)
	(= (slew_time Star6 Planet10) 18.3)
	(= (slew_time Planet10 Planet7) 64.65)
	(= (slew_time Planet7 Planet10) 64.65)
	(= (slew_time Planet10 Phenomenon8) 40.93)
	(= (slew_time Phenomenon8 Planet10) 40.93)
	(= (slew_time Planet10 Planet9) 38.51)
	(= (slew_time Planet9 Planet10) 38.51)
	(= (slew_time Phenomenon11 Star0) 72.74)
	(= (slew_time Star0 Phenomenon11) 72.74)
	(= (slew_time Phenomenon11 GroundStation1) 26.55)
	(= (slew_time GroundStation1 Phenomenon11) 26.55)
	(= (slew_time Phenomenon11 GroundStation2) 6.378)
	(= (slew_time GroundStation2 Phenomenon11) 6.378)
	(= (slew_time Phenomenon11 GroundStation3) 77.22)
	(= (slew_time GroundStation3 Phenomenon11) 77.22)
	(= (slew_time Phenomenon11 Star4) 32.63)
	(= (slew_time Star4 Phenomenon11) 32.63)
	(= (slew_time Phenomenon11 Planet5) 34.16)
	(= (slew_time Planet5 Phenomenon11) 34.16)
	(= (slew_time Phenomenon11 Star6) 17.95)
	(= (slew_time Star6 Phenomenon11) 17.95)
	(= (slew_time Phenomenon11 Planet7) 27.2)
	(= (slew_time Planet7 Phenomenon11) 27.2)
	(= (slew_time Phenomenon11 Phenomenon8) 45.93)
	(= (slew_time Phenomenon8 Phenomenon11) 45.93)
	(= (slew_time Phenomenon11 Planet9) 56.91)
	(= (slew_time Planet9 Phenomenon11) 56.91)
	(= (slew_time Phenomenon11 Planet10) 33.69)
	(= (slew_time Planet10 Phenomenon11) 33.69)
	(= (slew_time Planet12 Star0) 17.83)
	(= (slew_time Star0 Planet12) 17.83)
	(= (slew_time Planet12 GroundStation1) 13.61)
	(= (slew_time GroundStation1 Planet12) 13.61)
	(= (slew_time Planet12 GroundStation2) 37.13)
	(= (slew_time GroundStation2 Planet12) 37.13)
	(= (slew_time Planet12 GroundStation3) 45.79)
	(= (slew_time GroundStation3 Planet12) 45.79)
	(= (slew_time Planet12 Star4) 63.12)
	(= (slew_time Star4 Planet12) 63.12)
	(= (slew_time Planet12 Planet5) 14.23)
	(= (slew_time Planet5 Planet12) 14.23)
	(= (slew_time Planet12 Star6) 68.62)
	(= (slew_time Star6 Planet12) 68.62)
	(= (slew_time Planet12 Planet7) 1.662)
	(= (slew_time Planet7 Planet12) 1.662)
	(= (slew_time Planet12 Phenomenon8) 60.04)
	(= (slew_time Phenomenon8 Planet12) 60.04)
	(= (slew_time Planet12 Planet9) 12.33)
	(= (slew_time Planet9 Planet12) 12.33)
	(= (slew_time Planet12 Planet10) 49.26)
	(= (slew_time Planet10 Planet12) 49.26)
	(= (slew_time Planet12 Phenomenon11) 87.64)
	(= (slew_time Phenomenon11 Planet12) 87.64)
	(= (slew_time Planet13 Star0) 93.06)
	(= (slew_time Star0 Planet13) 93.06)
	(= (slew_time Planet13 GroundStation1) 39.59)
	(= (slew_time GroundStation1 Planet13) 39.59)
	(= (slew_time Planet13 GroundStation2) 54.28)
	(= (slew_time GroundStation2 Planet13) 54.28)
	(= (slew_time Planet13 GroundStation3) 3.975)
	(= (slew_time GroundStation3 Planet13) 3.975)
	(= (slew_time Planet13 Star4) 36.21)
	(= (slew_time Star4 Planet13) 36.21)
	(= (slew_time Planet13 Planet5) 14.68)
	(= (slew_time Planet5 Planet13) 14.68)
	(= (slew_time Planet13 Star6) 6.541)
	(= (slew_time Star6 Planet13) 6.541)
	(= (slew_time Planet13 Planet7) 0.6493)
	(= (slew_time Planet7 Planet13) 0.6493)
	(= (slew_time Planet13 Phenomenon8) 27.92)
	(= (slew_time Phenomenon8 Planet13) 27.92)
	(= (slew_time Planet13 Planet9) 16.47)
	(= (slew_time Planet9 Planet13) 16.47)
	(= (slew_time Planet13 Planet10) 9.686)
	(= (slew_time Planet10 Planet13) 9.686)
	(= (slew_time Planet13 Phenomenon11) 19.22)
	(= (slew_time Phenomenon11 Planet13) 19.22)
	(= (slew_time Planet13 Planet12) 37.54)
	(= (slew_time Planet12 Planet13) 37.54)
	(= (slew_time Star14 Star0) 28.68)
	(= (slew_time Star0 Star14) 28.68)
	(= (slew_time Star14 GroundStation1) 33.04)
	(= (slew_time GroundStation1 Star14) 33.04)
	(= (slew_time Star14 GroundStation2) 0.6174)
	(= (slew_time GroundStation2 Star14) 0.6174)
	(= (slew_time Star14 GroundStation3) 34.96)
	(= (slew_time GroundStation3 Star14) 34.96)
	(= (slew_time Star14 Star4) 25.92)
	(= (slew_time Star4 Star14) 25.92)
	(= (slew_time Star14 Planet5) 69.59)
	(= (slew_time Planet5 Star14) 69.59)
	(= (slew_time Star14 Star6) 8.083)
	(= (slew_time Star6 Star14) 8.083)
	(= (slew_time Star14 Planet7) 36.94)
	(= (slew_time Planet7 Star14) 36.94)
	(= (slew_time Star14 Phenomenon8) 25.31)
	(= (slew_time Phenomenon8 Star14) 25.31)
	(= (slew_time Star14 Planet9) 12.51)
	(= (slew_time Planet9 Star14) 12.51)
	(= (slew_time Star14 Planet10) 85.24)
	(= (slew_time Planet10 Star14) 85.24)
	(= (slew_time Star14 Phenomenon11) 46.04)
	(= (slew_time Phenomenon11 Star14) 46.04)
	(= (slew_time Star14 Planet12) 61.09)
	(= (slew_time Planet12 Star14) 61.09)
	(= (slew_time Star14 Planet13) 13.11)
	(= (slew_time Planet13 Star14) 13.11)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet5 infrared0)
	(have_image Star6 spectrograph2)
	(have_image Planet7 infrared0)
	(have_image Phenomenon8 spectrograph2)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 thermograph3)
	(have_image Planet13 infrared1)
	(have_image Star14 thermograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 172 to 78.94, (fuel-used) from 0 to 93.06
   goals met: 0 of 9
2. (turn_to satellite0 star6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 78.94 to 72.399, (fuel-used) from 93.06 to 99.601
   goals met: 0 of 9
3. (turn_to satellite2 groundstation3 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 180 to 169.84, (fuel-used) from 99.601 to 109.761
   goals met: 0 of 9
4. (turn_to satellite2 planet5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 169.84 to 126.68, (fuel-used) from 109.761 to 152.921
   goals met: 0 of 9
5. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
6. (turn_to satellite2 groundstation3 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 126.68 to 83.52, (fuel-used) from 152.921 to 196.081
   goals met: 0 of 9
7. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 9
8. (turn_to satellite2 planet5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 83.52 to 40.36, (fuel-used) from 196.081 to 239.241
   goals met: 0 of 9
9. (take_image satellite2 planet5 instrument3 infrared0)
   added: (have_image planet5 infrared0)
   changed: (data_capacity satellite2) from 1000 to 752, (data-stored) from 0 to 248
   goals met: 1 of 9
10. (turn_to satellite2 phenomenon8 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 40.36 to 29.92, (fuel-used) from 239.241 to 249.681
   goals met: 1 of 9
11. (take_image satellite2 phenomenon8 instrument3 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   changed: (data_capacity satellite2) from 752 to 537, (data-stored) from 248 to 463
   goals met: 2 of 9
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 9
13. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 72.399 to 49.579, (fuel-used) from 249.681 to 272.501
   goals met: 2 of 9
14. (turn_to satellite2 groundstation2 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 29.92 to 18.16, (fuel-used) from 272.501 to 284.261
   goals met: 2 of 9
15. (turn_to satellite0 planet13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 49.579 to 33.109, (fuel-used) from 284.261 to 300.731
   goals met: 2 of 9
16. (turn_to satellite2 star14 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star14)
   changed: (fuel satellite2) from 18.16 to 17.5426, (fuel-used) from 300.731 to 301.348
   goals met: 2 of 9
17. (take_image satellite2 star14 instrument3 thermograph3)
   added: (have_image star14 thermograph3)
   changed: (data_capacity satellite2) from 537 to 512, (data-stored) from 463 to 488
   goals met: 3 of 9
18. (turn_to satellite2 groundstation2 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 17.5426 to 16.9252, (fuel-used) from 301.348 to 301.966
   goals met: 3 of 9
19. (turn_to satellite2 phenomenon11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon11)
   changed: (fuel satellite2) from 16.9252 to 10.5472, (fuel-used) from 301.966 to 308.344
   goals met: 3 of 9
20. (take_image satellite2 phenomenon11 instrument3 infrared0)
   added: (have_image phenomenon11 infrared0)
   changed: (data_capacity satellite2) from 512 to 231, (data-stored) from 488 to 769
   goals met: 4 of 9
21. (turn_to satellite0 groundstation3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 33.109 to 29.134, (fuel-used) from 308.344 to 312.319
   goals met: 4 of 9
22. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 4 of 9
23. (turn_to satellite0 planet9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 29.134 to 28.6151, (fuel-used) from 312.319 to 312.838
   goals met: 4 of 9
24. (take_image satellite0 planet9 instrument1 thermograph3)
   added: (have_image planet9 thermograph3)
   changed: (data_capacity satellite0) from 1000 to 873, (data-stored) from 769 to 896
   goals met: 5 of 9
25. (turn_to satellite0 groundstation3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 28.6151 to 28.0962, (fuel-used) from 312.838 to 313.357
   goals met: 5 of 9
26. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 9
27. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 9
28. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 5 of 9
29. (turn_to satellite0 planet13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 28.0962 to 24.1212, (fuel-used) from 313.357 to 317.332
   goals met: 5 of 9
30. (turn_to satellite0 planet7 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 24.1212 to 23.4719, (fuel-used) from 317.332 to 317.981
   goals met: 5 of 9
31. (turn_to satellite0 planet12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet12)
   changed: (fuel satellite0) from 23.4719 to 21.8099, (fuel-used) from 317.981 to 319.643
   goals met: 5 of 9
32. (take_image satellite0 planet12 instrument0 thermograph3)
   added: (have_image planet12 thermograph3)
   changed: (data_capacity satellite0) from 873 to 658, (data-stored) from 896 to 1111
   goals met: 6 of 9
33. (turn_to satellite0 planet7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 21.8099 to 20.1479, (fuel-used) from 319.643 to 321.305
   goals met: 6 of 9
34. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   changed: (data_capacity satellite0) from 658 to 567, (data-stored) from 1111 to 1202
   goals met: 7 of 9
35. (turn_to satellite0 planet13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 20.1479 to 19.4986, (fuel-used) from 321.305 to 321.954
   goals met: 7 of 9
36. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 9
37. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 9
38. (turn_to satellite0 groundstation3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 19.4986 to 15.5236, (fuel-used) from 321.954 to 325.929
   goals met: 7 of 9
39. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 7 of 9
40. (turn_to satellite0 planet13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet13)
   changed: (fuel satellite0) from 15.5236 to 11.5486, (fuel-used) from 325.929 to 329.904
   goals met: 7 of 9
41. (take_image satellite0 planet13 instrument1 infrared1)
   added: (have_image planet13 infrared1)
   changed: (data_capacity satellite0) from 567 to 441, (data-stored) from 1202 to 1328
   goals met: 8 of 9
42. (turn_to satellite0 star6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 11.5486 to 5.0076, (fuel-used) from 329.904 to 336.445
   goals met: 8 of 9
43. (take_image satellite0 star6 instrument1 spectrograph2)
   added: (have_image star6 spectrograph2)
   changed: (data_capacity satellite0) from 441 to 282, (data-stored) from 1328 to 1487
   goals met: 9 of 9
